/* eslint-disable */
var cityData = [
	//0
	[{
		"title": "市辖区",
		"id": "1101"
	}],
	//1
	[{
		"title": "市辖区",
		"id": "1201"
	}],
	//2
	[{
			"title": "石家庄市",
			"id": "1301"
		},
		{
			"title": "唐山市",
			"id": "1302"
		},
		{
			"title": "秦皇岛市",
			"id": "1303"
		},
		{
			"title": "邯郸市",
			"id": "1304"
		},
		{
			"title": "邢台市",
			"id": "1305"
		},
		{
			"title": "保定市",
			"id": "1306"
		},
		{
			"title": "张家口市",
			"id": "1307"
		},
		{
			"title": "承德市",
			"id": "1308"
		},
		{
			"title": "沧州市",
			"id": "1309"
		},
		{
			"title": "廊坊市",
			"id": "1310"
		},
		{
			"title": "衡水市",
			"id": "1311"
		}
	],
	//3
	[{
			"title": "太原市",
			"id": "1401"
		},
		{
			"title": "大同市",
			"id": "1402"
		},
		{
			"title": "阳泉市",
			"id": "1403"
		},
		{
			"title": "长治市",
			"id": "1404"
		},
		{
			"title": "晋城市",
			"id": "1405"
		},
		{
			"title": "朔州市",
			"id": "1406"
		},
		{
			"title": "晋中市",
			"id": "1407"
		},
		{
			"title": "运城市",
			"id": "1408"
		},
		{
			"title": "忻州市",
			"id": "1409"
		},
		{
			"title": "临汾市",
			"id": "1410"
		},
		{
			"title": "吕梁市",
			"id": "1411"
		}
	],
	//4
	[{
			"title": "呼和浩特市",
			"id": "1501"
		},
		{
			"title": "包头市",
			"id": "1502"
		},
		{
			"title": "乌海市",
			"id": "1503"
		},
		{
			"title": "赤峰市",
			"id": "1504"
		},
		{
			"title": "通辽市",
			"id": "1505"
		},
		{
			"title": "鄂尔多斯市",
			"id": "1506"
		},
		{
			"title": "呼伦贝尔市",
			"id": "1507"
		},
		{
			"title": "巴彦淖尔市",
			"id": "1508"
		},
		{
			"title": "乌兰察布市",
			"id": "1509"
		},
		{
			"title": "兴安盟",
			"id": "1522"
		},
		{
			"title": "锡林郭勒盟",
			"id": "1525"
		},
		{
			"title": "阿拉善盟",
			"id": "1529"
		}
	],
	//5
	[{
			"title": "沈阳市",
			"id": "2101"
		},
		{
			"title": "大连市",
			"id": "2102"
		},
		{
			"title": "鞍山市",
			"id": "2103"
		},
		{
			"title": "抚顺市",
			"id": "2104"
		},
		{
			"title": "本溪市",
			"id": "2105"
		},
		{
			"title": "丹东市",
			"id": "2106"
		},
		{
			"title": "锦州市",
			"id": "2107"
		},
		{
			"title": "营口市",
			"id": "2108"
		},
		{
			"title": "阜新市",
			"id": "2109"
		},
		{
			"title": "辽阳市",
			"id": "2110"
		},
		{
			"title": "盘锦市",
			"id": "2111"
		},
		{
			"title": "铁岭市",
			"id": "2112"
		},
		{
			"title": "朝阳市",
			"id": "2113"
		},
		{
			"title": "葫芦岛市",
			"id": "2114"
		}
	],
	[{
			"title": "长春市",
			"id": "2201"
		},
		{
			"title": "吉林市",
			"id": "2202"
		},
		{
			"title": "四平市",
			"id": "2203"
		},
		{
			"title": "辽源市",
			"id": "2204"
		},
		{
			"title": "通化市",
			"id": "2205"
		},
		{
			"title": "白山市",
			"id": "2206"
		},
		{
			"title": "松原市",
			"id": "2207"
		},
		{
			"title": "白城市",
			"id": "2208"
		},
		{
			"title": "延边朝鲜族自治州",
			"id": "2224"
		}
	],
	[{
			"title": "哈尔滨市",
			"id": "2301"
		},
		{
			"title": "齐齐哈尔市",
			"id": "2302"
		},
		{
			"title": "鸡西市",
			"id": "2303"
		},
		{
			"title": "鹤岗市",
			"id": "2304"
		},
		{
			"title": "双鸭山市",
			"id": "2305"
		},
		{
			"title": "大庆市",
			"id": "2306"
		},
		{
			"title": "伊春市",
			"id": "2307"
		},
		{
			"title": "佳木斯市",
			"id": "2308"
		},
		{
			"title": "七台河市",
			"id": "2309"
		},
		{
			"title": "牡丹江市",
			"id": "2310"
		},
		{
			"title": "黑河市",
			"id": "2311"
		},
		{
			"title": "绥化市",
			"id": "2312"
		},
		{
			"title": "大兴安岭地区",
			"id": "2327"
		}
	],
	[{
		"title": "市辖区",
		"id": "3101"
	}],
	[{
			"title": "南京市",
			"id": "3201"
		},
		{
			"title": "无锡市",
			"id": "3202"
		},
		{
			"title": "徐州市",
			"id": "3203"
		},
		{
			"title": "常州市",
			"id": "3204"
		},
		{
			"title": "苏州市",
			"id": "3205"
		},
		{
			"title": "南通市",
			"id": "3206"
		},
		{
			"title": "连云港市",
			"id": "3207"
		},
		{
			"title": "淮安市",
			"id": "3208"
		},
		{
			"title": "盐城市",
			"id": "3209"
		},
		{
			"title": "扬州市",
			"id": "3210"
		},
		{
			"title": "镇江市",
			"id": "3211"
		},
		{
			"title": "泰州市",
			"id": "3212"
		},
		{
			"title": "宿迁市",
			"id": "3213"
		}
	],
	[{
			"title": "杭州市",
			"id": "3301"
		},
		{
			"title": "宁波市",
			"id": "3302"
		},
		{
			"title": "温州市",
			"id": "3303"
		},
		{
			"title": "嘉兴市",
			"id": "3304"
		},
		{
			"title": "湖州市",
			"id": "3305"
		},
		{
			"title": "绍兴市",
			"id": "3306"
		},
		{
			"title": "金华市",
			"id": "3307"
		},
		{
			"title": "衢州市",
			"id": "3308"
		},
		{
			"title": "舟山市",
			"id": "3309"
		},
		{
			"title": "台州市",
			"id": "3310"
		},
		{
			"title": "丽水市",
			"id": "3311"
		}
	],
	[{
			"title": "合肥市",
			"id": "3401"
		},
		{
			"title": "芜湖市",
			"id": "3402"
		},
		{
			"title": "蚌埠市",
			"id": "3403"
		},
		{
			"title": "淮南市",
			"id": "3404"
		},
		{
			"title": "马鞍山市",
			"id": "3405"
		},
		{
			"title": "淮北市",
			"id": "3406"
		},
		{
			"title": "铜陵市",
			"id": "3407"
		},
		{
			"title": "安庆市",
			"id": "3408"
		},
		{
			"title": "黄山市",
			"id": "3410"
		},
		{
			"title": "滁州市",
			"id": "3411"
		},
		{
			"title": "阜阳市",
			"id": "3412"
		},
		{
			"title": "宿州市",
			"id": "3413"
		},
		{
			"title": "六安市",
			"id": "3415"
		},
		{
			"title": "亳州市",
			"id": "3416"
		},
		{
			"title": "池州市",
			"id": "3417"
		},
		{
			"title": "宣城市",
			"id": "3418"
		}
	],
	[{
			"title": "福州市",
			"id": "3501"
		},
		{
			"title": "厦门市",
			"id": "3502"
		},
		{
			"title": "莆田市",
			"id": "3503"
		},
		{
			"title": "三明市",
			"id": "3504"
		},
		{
			"title": "泉州市",
			"id": "3505"
		},
		{
			"title": "漳州市",
			"id": "3506"
		},
		{
			"title": "南平市",
			"id": "3507"
		},
		{
			"title": "龙岩市",
			"id": "3508"
		},
		{
			"title": "宁德市",
			"id": "3509"
		}
	],
	[{
			"title": "南昌市",
			"id": "3601"
		},
		{
			"title": "景德镇市",
			"id": "3602"
		},
		{
			"title": "萍乡市",
			"id": "3603"
		},
		{
			"title": "九江市",
			"id": "3604"
		},
		{
			"title": "新余市",
			"id": "3605"
		},
		{
			"title": "鹰潭市",
			"id": "3606"
		},
		{
			"title": "赣州市",
			"id": "3607"
		},
		{
			"title": "吉安市",
			"id": "3608"
		},
		{
			"title": "宜春市",
			"id": "3609"
		},
		{
			"title": "抚州市",
			"id": "3610"
		},
		{
			"title": "上饶市",
			"id": "3611"
		}
	],
	[{
			"title": "济南市",
			"id": "3701"
		},
		{
			"title": "青岛市",
			"id": "3702"
		},
		{
			"title": "淄博市",
			"id": "3703"
		},
		{
			"title": "枣庄市",
			"id": "3704"
		},
		{
			"title": "东营市",
			"id": "3705"
		},
		{
			"title": "烟台市",
			"id": "3706"
		},
		{
			"title": "潍坊市",
			"id": "3707"
		},
		{
			"title": "济宁市",
			"id": "3708"
		},
		{
			"title": "泰安市",
			"id": "3709"
		},
		{
			"title": "威海市",
			"id": "3710"
		},
		{
			"title": "日照市",
			"id": "3711"
		},
		{
			"title": "莱芜市",
			"id": "3712"
		},
		{
			"title": "临沂市",
			"id": "3713"
		},
		{
			"title": "德州市",
			"id": "3714"
		},
		{
			"title": "聊城市",
			"id": "3715"
		},
		{
			"title": "滨州市",
			"id": "3716"
		},
		{
			"title": "菏泽市",
			"id": "3717"
		}
	],
	[{
			"title": "郑州市",
			"id": "4101"
		},
		{
			"title": "开封市",
			"id": "4102"
		},
		{
			"title": "洛阳市",
			"id": "4103"
		},
		{
			"title": "平顶山市",
			"id": "4104"
		},
		{
			"title": "安阳市",
			"id": "4105"
		},
		{
			"title": "鹤壁市",
			"id": "4106"
		},
		{
			"title": "新乡市",
			"id": "4107"
		},
		{
			"title": "焦作市",
			"id": "4108"
		},
		{
			"title": "濮阳市",
			"id": "4109"
		},
		{
			"title": "许昌市",
			"id": "4110"
		},
		{
			"title": "漯河市",
			"id": "4111"
		},
		{
			"title": "三门峡市",
			"id": "4112"
		},
		{
			"title": "南阳市",
			"id": "4113"
		},
		{
			"title": "商丘市",
			"id": "4114"
		},
		{
			"title": "信阳市",
			"id": "4115"
		},
		{
			"title": "周口市",
			"id": "4116"
		},
		{
			"title": "驻马店市",
			"id": "4117"
		},
		{
			"title": "省直辖县级行政区划",
			"id": "4190"
		}
	],
	[{
			"title": "武汉市",
			"id": "4201"
		},
		{
			"title": "黄石市",
			"id": "4202"
		},
		{
			"title": "十堰市",
			"id": "4203"
		},
		{
			"title": "宜昌市",
			"id": "4205"
		},
		{
			"title": "襄阳市",
			"id": "4206"
		},
		{
			"title": "鄂州市",
			"id": "4207"
		},
		{
			"title": "荆门市",
			"id": "4208"
		},
		{
			"title": "孝感市",
			"id": "4209"
		},
		{
			"title": "荆州市",
			"id": "4210"
		},
		{
			"title": "黄冈市",
			"id": "4211"
		},
		{
			"title": "咸宁市",
			"id": "4212"
		},
		{
			"title": "随州市",
			"id": "4213"
		},
		{
			"title": "恩施土家族苗族自治州",
			"id": "4228"
		},
		{
			"title": "省直辖县级行政区划",
			"id": "4290"
		}
	],
	[{
			"title": "长沙市",
			"id": "4301"
		},
		{
			"title": "株洲市",
			"id": "4302"
		},
		{
			"title": "湘潭市",
			"id": "4303"
		},
		{
			"title": "衡阳市",
			"id": "4304"
		},
		{
			"title": "邵阳市",
			"id": "4305"
		},
		{
			"title": "岳阳市",
			"id": "4306"
		},
		{
			"title": "常德市",
			"id": "4307"
		},
		{
			"title": "张家界市",
			"id": "4308"
		},
		{
			"title": "益阳市",
			"id": "4309"
		},
		{
			"title": "郴州市",
			"id": "4310"
		},
		{
			"title": "永州市",
			"id": "4311"
		},
		{
			"title": "怀化市",
			"id": "4312"
		},
		{
			"title": "娄底市",
			"id": "4313"
		},
		{
			"title": "湘西土家族苗族自治州",
			"id": "4331"
		}
	],
	[{
			"title": "广州市",
			"id": "4401"
		},
		{
			"title": "韶关市",
			"id": "4402"
		},
		{
			"title": "深圳市",
			"id": "4403"
		},
		{
			"title": "珠海市",
			"id": "4404"
		},
		{
			"title": "汕头市",
			"id": "4405"
		},
		{
			"title": "佛山市",
			"id": "4406"
		},
		{
			"title": "江门市",
			"id": "4407"
		},
		{
			"title": "湛江市",
			"id": "4408"
		},
		{
			"title": "茂名市",
			"id": "4409"
		},
		{
			"title": "肇庆市",
			"id": "4412"
		},
		{
			"title": "惠州市",
			"id": "4413"
		},
		{
			"title": "梅州市",
			"id": "4414"
		},
		{
			"title": "汕尾市",
			"id": "4415"
		},
		{
			"title": "河源市",
			"id": "4416"
		},
		{
			"title": "阳江市",
			"id": "4417"
		},
		{
			"title": "清远市",
			"id": "4418"
		},
		{
			"title": "东莞市",
			"id": "4419"
		},
		{
			"title": "中山市",
			"id": "4420"
		},
		{
			"title": "潮州市",
			"id": "4451"
		},
		{
			"title": "揭阳市",
			"id": "4452"
		},
		{
			"title": "云浮市",
			"id": "4453"
		}
	],
	[{
			"title": "南宁市",
			"id": "4501"
		},
		{
			"title": "柳州市",
			"id": "4502"
		},
		{
			"title": "桂林市",
			"id": "4503"
		},
		{
			"title": "梧州市",
			"id": "4504"
		},
		{
			"title": "北海市",
			"id": "4505"
		},
		{
			"title": "防城港市",
			"id": "4506"
		},
		{
			"title": "钦州市",
			"id": "4507"
		},
		{
			"title": "贵港市",
			"id": "4508"
		},
		{
			"title": "玉林市",
			"id": "4509"
		},
		{
			"title": "百色市",
			"id": "4510"
		},
		{
			"title": "贺州市",
			"id": "4511"
		},
		{
			"title": "河池市",
			"id": "4512"
		},
		{
			"title": "来宾市",
			"id": "4513"
		},
		{
			"title": "崇左市",
			"id": "4514"
		}
	],
	[{
			"title": "海口市",
			"id": "4601"
		},
		{
			"title": "三亚市",
			"id": "4602"
		},
		{
			"title": "三沙市",
			"id": "4603"
		},
		{
			"title": "儋州市",
			"id": "4604"
		},
		{
			"title": "省直辖县级行政区划",
			"id": "4690"
		}
	],
	[{
			"title": "市辖区",
			"id": "5001"
		},
		{
			"title": "县",
			"id": "5002"
		}
	],
	[{
			"title": "成都市",
			"id": "5101"
		},
		{
			"title": "自贡市",
			"id": "5103"
		},
		{
			"title": "攀枝花市",
			"id": "5104"
		},
		{
			"title": "泸州市",
			"id": "5105"
		},
		{
			"title": "德阳市",
			"id": "5106"
		},
		{
			"title": "绵阳市",
			"id": "5107"
		},
		{
			"title": "广元市",
			"id": "5108"
		},
		{
			"title": "遂宁市",
			"id": "5109"
		},
		{
			"title": "内江市",
			"id": "5110"
		},
		{
			"title": "乐山市",
			"id": "5111"
		},
		{
			"title": "南充市",
			"id": "5113"
		},
		{
			"title": "眉山市",
			"id": "5114"
		},
		{
			"title": "宜宾市",
			"id": "5115"
		},
		{
			"title": "广安市",
			"id": "5116"
		},
		{
			"title": "达州市",
			"id": "5117"
		},
		{
			"title": "雅安市",
			"id": "5118"
		},
		{
			"title": "巴中市",
			"id": "5119"
		},
		{
			"title": "资阳市",
			"id": "5120"
		},
		{
			"title": "阿坝藏族羌族自治州",
			"id": "5132"
		},
		{
			"title": "甘孜藏族自治州",
			"id": "5133"
		},
		{
			"title": "凉山彝族自治州",
			"id": "5134"
		}
	],
	[{
			"title": "贵阳市",
			"id": "5201"
		},
		{
			"title": "六盘水市",
			"id": "5202"
		},
		{
			"title": "遵义市",
			"id": "5203"
		},
		{
			"title": "安顺市",
			"id": "5204"
		},
		{
			"title": "毕节市",
			"id": "5205"
		},
		{
			"title": "铜仁市",
			"id": "5206"
		},
		{
			"title": "黔西南布依族苗族自治州",
			"id": "5223"
		},
		{
			"title": "黔东南苗族侗族自治州",
			"id": "5226"
		},
		{
			"title": "黔南布依族苗族自治州",
			"id": "5227"
		}
	],
	[{
			"title": "昆明市",
			"id": "5301"
		},
		{
			"title": "曲靖市",
			"id": "5303"
		},
		{
			"title": "玉溪市",
			"id": "5304"
		},
		{
			"title": "保山市",
			"id": "5305"
		},
		{
			"title": "昭通市",
			"id": "5306"
		},
		{
			"title": "丽江市",
			"id": "5307"
		},
		{
			"title": "普洱市",
			"id": "5308"
		},
		{
			"title": "临沧市",
			"id": "5309"
		},
		{
			"title": "楚雄彝族自治州",
			"id": "5323"
		},
		{
			"title": "红河哈尼族彝族自治州",
			"id": "5325"
		},
		{
			"title": "文山壮族苗族自治州",
			"id": "5326"
		},
		{
			"title": "西双版纳傣族自治州",
			"id": "5328"
		},
		{
			"title": "大理白族自治州",
			"id": "5329"
		},
		{
			"title": "德宏傣族景颇族自治州",
			"id": "5331"
		},
		{
			"title": "怒江傈僳族自治州",
			"id": "5333"
		},
		{
			"title": "迪庆藏族自治州",
			"id": "5334"
		}
	],
	[{
			"title": "拉萨市",
			"id": "5401"
		},
		{
			"title": "日喀则市",
			"id": "5402"
		},
		{
			"title": "昌都市",
			"id": "5403"
		},
		{
			"title": "林芝市",
			"id": "5404"
		},
		{
			"title": "山南市",
			"id": "5405"
		},
		{
			"title": "那曲地区",
			"id": "5424"
		},
		{
			"title": "阿里地区",
			"id": "5425"
		}
	],
	[{
			"title": "西安市",
			"id": "6101"
		},
		{
			"title": "铜川市",
			"id": "6102"
		},
		{
			"title": "宝鸡市",
			"id": "6103"
		},
		{
			"title": "咸阳市",
			"id": "6104"
		},
		{
			"title": "渭南市",
			"id": "6105"
		},
		{
			"title": "延安市",
			"id": "6106"
		},
		{
			"title": "汉中市",
			"id": "6107"
		},
		{
			"title": "榆林市",
			"id": "6108"
		},
		{
			"title": "安康市",
			"id": "6109"
		},
		{
			"title": "商洛市",
			"id": "6110"
		}
	],
	[{
			"title": "兰州市",
			"id": "6201"
		},
		{
			"title": "嘉峪关市",
			"id": "6202"
		},
		{
			"title": "金昌市",
			"id": "6203"
		},
		{
			"title": "白银市",
			"id": "6204"
		},
		{
			"title": "天水市",
			"id": "6205"
		},
		{
			"title": "武威市",
			"id": "6206"
		},
		{
			"title": "张掖市",
			"id": "6207"
		},
		{
			"title": "平凉市",
			"id": "6208"
		},
		{
			"title": "酒泉市",
			"id": "6209"
		},
		{
			"title": "庆阳市",
			"id": "6210"
		},
		{
			"title": "定西市",
			"id": "6211"
		},
		{
			"title": "陇南市",
			"id": "6212"
		},
		{
			"title": "临夏回族自治州",
			"id": "6229"
		},
		{
			"title": "甘南藏族自治州",
			"id": "6230"
		}
	],
	[{
			"title": "西宁市",
			"id": "6301"
		},
		{
			"title": "海东市",
			"id": "6302"
		},
		{
			"title": "海北藏族自治州",
			"id": "6322"
		},
		{
			"title": "黄南藏族自治州",
			"id": "6323"
		},
		{
			"title": "海南藏族自治州",
			"id": "6325"
		},
		{
			"title": "果洛藏族自治州",
			"id": "6326"
		},
		{
			"title": "玉树藏族自治州",
			"id": "6327"
		},
		{
			"title": "海西蒙古族藏族自治州",
			"id": "6328"
		}
	],
	[{
			"title": "银川市",
			"id": "6401"
		},
		{
			"title": "石嘴山市",
			"id": "6402"
		},
		{
			"title": "吴忠市",
			"id": "6403"
		},
		{
			"title": "固原市",
			"id": "6404"
		},
		{
			"title": "中卫市",
			"id": "6405"
		}
	],
	[{
			"title": "乌鲁木齐市",
			"id": "6501"
		},
		{
			"title": "克拉玛依市",
			"id": "6502"
		},
		{
			"title": "吐鲁番市",
			"id": "6504"
		},
		{
			"title": "哈密市",
			"id": "6505"
		},
		{
			"title": "昌吉回族自治州",
			"id": "6523"
		},
		{
			"title": "博尔塔拉蒙古自治州",
			"id": "6527"
		},
		{
			"title": "巴音郭楞蒙古自治州",
			"id": "6528"
		},
		{
			"title": "阿克苏地区",
			"id": "6529"
		},
		{
			"title": "克孜勒苏柯尔克孜自治州",
			"id": "6530"
		},
		{
			"title": "喀什地区",
			"id": "6531"
		},
		{
			"title": "和田地区",
			"id": "6532"
		},
		{
			"title": "伊犁哈萨克自治州",
			"id": "6540"
		},
		{
			"title": "塔城地区",
			"id": "6542"
		},
		{
			"title": "阿勒泰地区",
			"id": "6543"
		},
		{
			"title": "自治区直辖县级行政区划",
			"id": "6590"
		}
	],
	[{
			"title": "台北",
			"id": "6601"
		},
		{
			"title": "高雄",
			"id": "6602"
		},
		{
			"title": "基隆",
			"id": "6603"
		},
		{
			"title": "台中",
			"id": "6604"
		},
		{
			"title": "台南",
			"id": "6605"
		},
		{
			"title": "新竹",
			"id": "6606"
		},
		{
			"title": "嘉义",
			"id": "6607"
		},
		{
			"title": "宜兰",
			"id": "6608"
		},
		{
			"title": "桃园",
			"id": "6609"
		},
		{
			"title": "苗栗",
			"id": "6610"
		},
		{
			"title": "彰化",
			"id": "6611"
		},
		{
			"title": "南投",
			"id": "6612"
		},
		{
			"title": "云林",
			"id": "6613"
		},
		{
			"title": "屏东",
			"id": "6614"
		},
		{
			"title": "台东",
			"id": "6615"
		},
		{
			"title": "花莲",
			"id": "6616"
		},
		{
			"title": "澎湖",
			"id": "6617"
		}
	],
	[{
			"title": "香港岛",
			"id": "6701"
		},
		{
			"title": "九龙",
			"id": "6702"
		},
		{
			"title": "新界",
			"id": "6703"
		}
	],
	[{
			"title": "澳门半岛",
			"id": "6801"
		},
		{
			"title": "氹仔岛",
			"id": "6802"
		},
		{
			"title": "路环岛",
			"id": "6803"
		},
		{
			"title": "路氹城",
			"id": "6804"
		}
	]
]


// export default cityData;
