/* eslint-disable */
var provinceData = [{
    "title": "北京市",
    "id": "11"
  },
  {
    "title": "天津市",
    "id": "12"
  },
  {
    "title": "河北省",
    "id": "13"
  },
  {
    "title": "山西省",
    "id": "14"
  },
  {
    "title": "内蒙古自治区",
    "id": "15"
  },
  {
    "title": "辽宁省",
    "id": "16"
  },
  {
    "title": "吉林省",
    "id": "17"
  },
  {
    "title": "黑龙江省",
    "id": "18"
  },
  {
    "title": "上海市",
    "id": "19"
  },
  {
    "title": "江苏省",
    "id": "20"
  },
  {
    "title": "浙江省",
    "id": "21"
  },
  {
    "title": "安徽省",
    "id": "22"
  },
  {
    "title": "福建省",
    "id": "23"
  },
  {
    "title": "江西省",
    "id": "24"
  },
  {
    "title": "山东省",
    "id": "25"
  },
  {
    "title": "河南省",
    "id": "26"
  },
  {
    "title": "湖北省",
    "id": "27"
  },
  {
    "title": "湖南省",
    "id": "28"
  },
  {
    "title": "广东省",
    "id": "29"
  },
  // {
  //   "title": "广西壮族自治区",
  //   "id": "45"
  // },
  {
    "title": "海南省",
    "id": "31"
  },
  {
    "title": "重庆市",
    "id": "32"
  },
  {
    "title": "四川省",
    "id": "33"
  },
  {
    "title": "贵州省",
    "id": "34"
  },
  {
    "title": "云南省",
    "id": "35"
  },
  // {
  //   "title": "西藏自治区",
  //   "id": "54"
  // },
  {
    "title": "陕西省",
    "id": "37"
  },
  {
    "title": "甘肃省",
    "id": "38"
  },
  {
    "title": "青海省",
    "id": "39"
  }
  // {
  //   "title": "宁夏回族自治区",
  //   "id": "64"
  // },
  // {
  //   "title": "新疆维吾尔自治区",
  //   "id": "65"
  // },
  // {
  //   "title": "台湾",
  //   "id": "66"
  // },
  // {
  //   "title": "香港",
  //   "id": "67"
  // },
  // {
  //   "title": "澳门",
  //   "id": "68"
  // }
]
// export default provinceData;
